Tekla Open API Reference for Tekla Structures 2025
ShapeSelectionForm Constructor (List<ShapeItem>, String)
 Initializes a new instance of the ShapeSelectionForm class, selecting the given Shape in the tree control.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ShapeSelectionForm(
	List<ShapeItem> shapes,
	string shape
)
Public Sub New (
	shapes As List(Of ShapeItem),
	shape As String
)
Parameters
shapes
Type: System.Collections.Generic.List<ShapeItem>
The Shapes to be added to the dialog.
shape
Type: System.String
The Shape to be selected in the tree.
See Also
Reference
ShapeSelectionForm Class
ShapeSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace